#include <stdio.h>
#include <stdlib.h>
#include "globals.h"
#include "legoland.h"

#include "balloonz.h"
#include "binv.h"
#include "bloke.h"
#include "gamemap.h"
#include "image_sprite.h"
#include "llidb.h"
#include "man3d.h"
#include "map_object.h"
#include "math.h"
#include "obj_instance.h"
#include "print_sprite.h"
#include "render3d.h"

struct BalloonRideObj {
    /* 0x00 */ unsigned char pad_0[0xc];
    /* 0x0c */ struct BalloonRide *ride;
};

struct BalloonRide {
    /* 0x00 */ unsigned char pad_0[0xc];
    /* 0x0c */ unsigned int x;
    /* 0x10 */ unsigned int y;
    /* 0x14 */ unsigned int field_14;
    /* 0x18 */ unsigned int field_18;
    /* 0x1c */ unsigned int flags;
    /* 0x20 */ unsigned char pad_20[0x64 - 0x20];
    /* 0x64 */ void *layer;
    /* 0x68 */ unsigned char pad_68[0xcc - 0x68];
    /* 0xcc */ struct BalloonListElem *list;
};

struct BalloonListElem {
    /* 0x00 */ struct BalloonListElem *next;
    /* 0x04 */ unsigned char pad_4[0x8 - 0x4];
    /* 0x08 */ struct Bloke *bloke;
    /* 0x0c */ unsigned short id;
};

struct CursorState {
    unsigned char pad_0[0x3c];
    unsigned int var_3c;
};

// FUNCTION: LEGOLAND 0x0042a7b0
void FUN_0042a7b0(struct BalloonRideObj *param_1) {
    DAT_0081cde4 = param_1->ride;
    ((struct BalloonRide *)DAT_0081cde4)->flags |= 0x420;
    DAT_00616044 = ((struct BalloonRide *)DAT_0081cde4)->layer;
    ((struct BalloonRide *)DAT_0081cde4)->flags |= 0x2000;
    // STRING: LEGOLAND 0x004b64ac
    DAT_00616048 = LoadSprite("Ballbasem1.lls", 1);
    // STRING: LEGOLAND 0x004b649c
    DAT_0061604c = LoadSprite("Ballbasem2.lls", 1);
    // STRING: LEGOLAND 0x004b648c
    DAT_00616050 = LoadSprite("Ballbasem3.lls", 1);
    // STRING: LEGOLAND 0x004b647c
    DAT_00616054 = LoadSprite("BZRedCarM1.lls", 1);
    // STRING: LEGOLAND 0x004b6468
    DAT_00616058 = LoadSprite("BZGreenCarM1.lls", 1);
    // STRING: LEGOLAND 0x004b6458
    DAT_0061605c = LoadSprite("BZBlueCarM1.lls", 1);
    // STRING: LEGOLAND 0x004b6448
