#include "legoland.h"
#include "math.h"
#include "crt.h"
#include "globals.h"

#include "clipping.h"
#include "timer.h"
#include "icon.h"
#include "render.h"
#include "gfx.h"
#include "llidb.h"
#include "interface.h"
#include "print_sprite.h"

struct Sprite;

struct IconAnim {
    /* 0x00 */ struct LLS *lls;
    /* 0x04 */ unsigned char pad_4[0x14 - 0x4];
    /* 0x14 */ int kind;
};

struct IconSprite {
    /* 0x00 */ unsigned char pad_0[8];
    /* 0x08 */ struct IconAnim *anim;
};

struct PrintCtx {
    /* 0x00 */ unsigned int flags;
    /* 0x04 */ struct IconNode *node;
    /* 0x08 */ unsigned int field_8;
};

struct IconGroupRef {
    unsigned char pad_0[3];
    unsigned char field_3;
    unsigned char field_4;
    unsigned char field_5;
    unsigned char field_6;
};

struct Rect16 {
    unsigned char pad_0[0xc];
    short field_c;
    short field_e;
    short field_10;
    short field_12;
};

struct Rect32 {
    int field_0;
    int field_4;
    int field_8;
    int field_c;
};

struct Config {
    unsigned short field_0;
    unsigned short field_2;
};


struct Bbox {
    int min_x;
    int min_y;
    int max_x;
    int max_y;
};

struct Indicator {
    struct Indicator *next;
    unsigned int field_4;
    unsigned int field_8;
    unsigned int field_c;
    unsigned int field_10;
    struct IconNode *field_14;
    unsigned int field_18;
    void (*field_1c)(struct Indicator *);
    unsigned char pad_20[0x22 - 0x20];
    unsigned char field_22;
};

struct CtrlBuffer {
    unsigned char pad_0[8];
    int field_8;
};

struct ScrollRegion {
    /* 0x00 */ short field_0;
    /* 0x02 */ unsigned char pad_2[0x4 - 0x2];
    /* 0x04 */ unsigned char field_4;
    /* 0x05 */ unsigned char pad_5[0xc - 0x5];
    /* 0x0c */ int field_c;
    /* 0x10 */ int field_10;
    /* 0x14 */ int field_14;
    /* 0x18 */ int field_18;
    /* 0x1c */ int field_1c;
    /* 0x20 */ int field_20;
    /* 0x24 */ int field_24;
    /* 0x28 */ int field_28;
};

struct IndicatorFuncs {
    unsigned char pad_0[4];
    unsigned int field_4;
    unsigned char pad_8[0x18 - 0x8];
    unsigned int field_18;
    unsigned int field_1c;
};

struct TimedIndicator {
    struct Indicator *next;
    unsigned int field_4;
    unsigned int field_8;
    unsigned int field_c;
    unsigned int field_10;
    struct IconNode *field_14;
    unsigned int field_18;
    unsigned int field_1c;
};

#include "image_sprite.h"

struct SpriteLLS;
LEGO_EXPORT unsigned int GetLLSForSprite(struct SpriteLLS *sprite);
LEGO_EXPORT void PrintCent(int x, int y, int param_3, void *text, int param_5);
int FUN_00458930(double value);
LEGO_EXPORT int GetObjCost(void *info);
LEGO_EXPORT void SetEditObject(void *obj);
void FUN_00471ca0(void *param);
LEGO_EXPORT void *PlayInstanceOfSample(void *def, unsigned int looping, unsigned int a3, unsigned int a4);
LEGO_EXPORT int GetBrickCount(void);
int FUN_0048aef0(void *param_1, void *param_2);
