#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "globals.h"
#include "legoland.h"
#include "math.h"

#include "clipping.h"
#include "controller.h"
#include "gfx.h"
#include "icon.h"
#include "interface.h"
#include "llidb.h"
#include "map_object.h"
#include "print_sprite.h"
#include "render.h"
#include "string.h"
#include "timer.h"

struct Sprite;

struct IconAnim {
    /* 0x00 */ struct LLS *lls;
    /* 0x04 */ unsigned char pad_4[0x14 - 0x4];
    /* 0x14 */ int kind;
};

struct IconSprite {
    /* 0x00 */ unsigned char pad_0[8];
    /* 0x08 */ struct IconAnim *anim;
};

struct Rect16 {
    unsigned char pad_0[0xc];
    short field_c;
    short field_e;
    short field_10;
    short field_12;
};

struct Rect32 {
    int field_0;
    int field_4;
    int field_8;
    int field_c;
};

struct Config {
    unsigned short field_0;
    unsigned short field_2;
};

struct Bbox {
    int min_x;
    int min_y;
    int max_x;
    int max_y;
};

struct Indicator {
    struct Indicator *next;
    unsigned int field_4;
    unsigned int field_8;
    unsigned int field_c;
    unsigned int field_10;
    struct IconNode *field_14;
    unsigned int field_18;
    void (*field_1c)(struct Indicator *);
    unsigned char pad_20[0x22 - 0x20];
    unsigned char field_22;
};

struct MenuGroup {
    /* 0x00 */ short field_0;
    /* 0x02 */ unsigned char pad_2[0x4 - 0x2];
    /* 0x04 */ unsigned int field_4;
    /* 0x08 */ struct IconNode *field_8;
    /* 0x0c */ int field_c;
    /* 0x10 */ int field_10;
    /* 0x14 */ int field_14;
    /* 0x18 */ int field_18;
    /* 0x1c */ int field_1c;
    /* 0x20 */ int field_20;
    /* 0x24 */ int field_24;
    /* 0x28 */ int field_28;
};

struct ListElement {
    /* 0x00 */ unsigned char pad_0[8];
    /* 0x08 */ unsigned char field_8;
    /* 0x09 */ unsigned char pad_9[0xc - 0x9];
    /* 0x0c */ int *field_c;
};

struct InfoSource {
    /* 0x00 */ unsigned char pad_0[4];
    /* 0x04 */ void *field_4;
    /* 0x08 */ void *field_8;
    /* 0x0c */ unsigned char pad_c[0x10 - 0xc];
    /* 0x10 */ unsigned int field_10;
    /* 0x14 */ struct Sprite *field_14;
    /* 0x18 */ unsigned char pad_18[0x68 - 0x18];
    /* 0x68 */ struct Sprite *field_68;
    /* 0x6c */ unsigned char pad_6c[0x78 - 0x6c];
    /* 0x78 */ void *field_78;
    /* 0x7c */ void *field_7c;
    /* 0x80 */ unsigned char pad_80[0xc4 - 0x80];
    /* 0xc4 */ unsigned int *field_c4;
};

struct ScrollRegion {
    /* 0x00 */ short field_0;
    /* 0x02 */ unsigned char pad_2[0x4 - 0x2];
    /* 0x04 */ unsigned char field_4;
    /* 0x05 */ unsigned char pad_5[0xc - 0x5];
    /* 0x0c */ int field_c;
    /* 0x10 */ int field_10;
    /* 0x14 */ int field_14;
    /* 0x18 */ int field_18;
    /* 0x1c */ int field_1c;
    /* 0x20 */ int field_20;
    /* 0x24 */ int field_24;
    /* 0x28 */ int field_28;
};

struct IndicatorFuncs {
    unsigned char pad_0[4];
    unsigned int field_4;
    unsigned char pad_8[0x18 - 0x8];
    unsigned int field_18;
    unsigned int field_1c;
};

struct TimedIndicator {
    struct Indicator *next;
    unsigned int field_4;
    unsigned int field_8;
    unsigned int field_c;
    unsigned int field_10;
    struct IconNode *field_14;
    unsigned int field_18;
    unsigned int field_1c;
};

#include "bricks.h"
#include "freeplay.h"
#include "image_sprite.h"
#include "objclass.h"
#include "popupinfo.h"
#include "render3d.h"
#include "screens.h"
#include "sound_music.h"
#include "text.h"

// FUNCTION: LEGOLAND 0x0046d3a0
void FUN_0046d3a0(void) { DAT_006687a4 = 4; }

// FUNCTION: LEGOLAND 0x0046d3c0
void FUN_0046d3c0(struct IconNode *node) {
    if (!node) {
        return;
    }
    if (node->sprite) {
        KillSprite(node->sprite);
        node->sprite = NULL;
    }
    if (node->flags & 0x80) {
        if (node->field_30) {
