#include "interface.h"
#include <stdlib.h>
#include <string.h>
#include "challenge.h"
#include "controller.h"
#include "draw.h"
#include "globals.h"
#include "icon.h"
#include "legoland.h"
#include "llidb.h"
#include "nerps.h"
#include "objclass.h"
#include "popupinfo.h"
#include "print_sprite.h"
#include "profile_io.h"
#include "screens.h"
#include "sound_music.h"
#include "string.h"
#include "timer.h"
#include "title.h"
#include "wndenv.h"
#include "worker_mouse.h"

struct ProfileObj {
    unsigned char pad_0[0x34];
    unsigned int flags;
};

struct InterfaceObj {
    unsigned char pad_0[0x2c];
    void *field_2c;
    unsigned char pad_30[0x34 - 0x30];
    unsigned int field_34;
    char *field_38;
    unsigned int field_3c;
};

struct ObjectClassInfo {
    /* 0x00 */ char *name;
    /* 0x04 */ unsigned char pad_4[0x8 - 0x4];
    /* 0x08 */ unsigned int flags;
    /* 0x0c */ struct EditObject *field_c;
};

struct BuildObject;

struct LLDBElem {
    unsigned char pad_0[0x8];
    /* 0x08 */ unsigned int flags;
    /* 0x0c */ struct BuildObject *obj;
};

struct MovieHandle {
    /* 0x00 */ unsigned int field_0;
    /* 0x04 */ unsigned int field_4;
    /* 0x08 */ int field_8;
    /* 0x0c */ int field_c;
    /* 0x10 */ void *file;
    /* 0x14 */ void *frame;
    /* 0x18 */ void *audio_stream;
    /* 0x1c */ void *video_stream;
    /* 0x20 */ unsigned char pad_20[0x28 - 0x20];
};

struct AviFileInfo {
    unsigned char pad_0[0xc];
    /* 0x0c */ int streams;
    unsigned char pad_10[0x6c - 0x10];
};

struct AviStreamInfo {
    /* 0x00 */ unsigned int type;
    unsigned char pad_4[0x14 - 0x4];
    /* 0x14 */ unsigned int scale;
    /* 0x18 */ unsigned int rate;
    unsigned char pad_1c[0x20 - 0x1c];
    /* 0x20 */ unsigned int length;
    unsigned char pad_24[0x30 - 0x24];
    /* 0x30 */ unsigned int sample_size;
    /* 0x34 */ int frame_left;
    /* 0x38 */ int frame_top;
    /* 0x3c */ int frame_right;
    /* 0x40 */ int frame_bottom;
    unsigned char pad_44[0x8c - 0x44];
};

struct BuildObject {
    unsigned char pad_0[0x1c];
    /* 0x1c */ unsigned int field_1c;
    unsigned char pad_20[0x58 - 0x20];
    /* 0x58 */ void *field_58;
    /* 0x5c */ void *field_5c;
    /* 0x60 */ void *field_60;
    unsigned char pad_64[0x7c - 0x64];
    /* 0x7c */ char *field_7c;
    unsigned char pad_80[0xc4 - 0x80];
    /* 0xc4 */ struct ObjectClassInfo *field_c4;
};

struct PathControlElem {
    unsigned char pad_0[0xc];
    /* 0x0c */ struct BuildObject *obj;
};

struct EventNode {
    struct EventNode *next;
    unsigned char pad_4[0x1c - 0x4];
    int sort_key;
};

struct QueryNode {
    struct QueryNode *next;
    unsigned char pad_4[0x8 - 0x4];
    unsigned int field_8;
    unsigned int field_c;
};

#include "image_sprite.h"
#include "imports.h"
#include "mapscreen.h"
#include "stream.h"

// FUNCTION: LEGOLAND 0x004741f0
LEGO_EXPORT void Load_Interface_ControlIcons(void) {
    if (DAT_00668ea4 != 0) {
        return;
    }
    DAT_00668ea4 = 1;
    // STRING: LEGOLAND 0x004bb3b4
    DAT_00668e68 = LoadSprite("InterfaceBG.lls", 4);
    // STRING: LEGOLAND 0x004bb3a4
    DAT_00668e6c = LoadSprite("No_Energy.lls", 4);
    // STRING: LEGOLAND 0x004bb394
    DAT_00668e70 = LoadSprite("Bar_pointer.lls", 4);
    // STRING: LEGOLAND 0x004bb37c
    DAT_007fdcd0 = LoadSprite("IF_PathIconPressed.lls", 4);
    // STRING: LEGOLAND 0x004bb36c
    DAT_007fdd50 = LoadSprite("IF_PathIcon.lls", 4);
