#include "legoland.h"
#include "crt.h"
#include "globals.h"
#include "string.h"
#include "worker_mouse.h"
#include "profile_io.h"
#include "screens.h"
#include "title.h"
#include "nerps.h"
#include "popupinfo.h"
#include "objclass.h"
#include "icon.h"
#include "interface.h"
#include "sound_music.h"
#include "llidb.h"

struct ProfileObj {
    unsigned char pad_0[0x34];
    unsigned int flags;
};

struct InterfaceObj {
    unsigned char pad_0[0x2c];
    void *field_2c;
    unsigned char pad_30[0x34 - 0x30];
    unsigned int field_34;
    unsigned int field_38;
    unsigned int field_3c;
};

struct ObjectClassInfo {
    /* 0x00 */ char *name;
    /* 0x04 */ unsigned char pad_4[0x8 - 0x4];
    /* 0x08 */ unsigned int flags;
};

struct BuildObject;

struct LLDBElem {
    unsigned char pad_0[0xc];
    /* 0x0c */ struct BuildObject *obj;
};

struct BuildObject {
    unsigned char pad_0[0x1c];
    /* 0x1c */ unsigned int field_1c;
    unsigned char pad_20[0x58 - 0x20];
    /* 0x58 */ void *field_58;
    /* 0x5c */ void *field_5c;
    /* 0x60 */ void *field_60;
    unsigned char pad_64[0xc4 - 0x64];
    /* 0xc4 */ struct ObjectClassInfo *field_c4;
};

struct EventNode {
    struct EventNode *next;
    unsigned char pad_4[0x1c - 0x4];
    int sort_key;
};

struct QueryNode {
    struct QueryNode *next;
    unsigned char pad_4[0x8 - 0x4];
    unsigned int field_8;
    unsigned int field_c;
};



#include "image_sprite.h"
#include "stream.h"

char FUN_00475c50(int param_1, unsigned char param_2);
char FUN_00475c90(int param_1, unsigned char param_2);
extern void FUN_004562e0(void);
void FUN_00474750(void);
LEGO_EXPORT unsigned int TestMenu(unsigned int *entry);


// FUNCTION: LEGOLAND 0x004741f0
LEGO_EXPORT void Load_Interface_ControlIcons(void) {
    if (DAT_00668ea4 != 0) {
        return;
    }
    DAT_00668ea4 = 1;
    // STRING: LEGOLAND 0x004bb3b4
    DAT_00668e68 = LoadSprite("InterfaceBG.lls", 4);
    // STRING: LEGOLAND 0x004bb3a4
    DAT_00668e6c = LoadSprite("No_Energy.lls", 4);
    // STRING: LEGOLAND 0x004bb394
    DAT_00668e70 = LoadSprite("Bar_pointer.lls", 4);
