#include "legoland.h"
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <windows.h>
#include <ddraw.h>
#include "globals.h"
#include "worker_mouse.h"
#include "popupinfo.h"
#include "icon.h"
#include "text.h"

#pragma intrinsic(strlen, strcpy, memcpy)

struct Sprite;

struct InfoIcon {
    /* 0x00 */ unsigned char pad_0[0xc];
    /* 0x0c */ short x;
    /* 0x0e */ short y;
    /* 0x10 */ short field_10;
    /* 0x12 */ short field_12;
    /* 0x14 */ unsigned char pad_14[0x2c - 0x14];
    /* 0x2c */ void (*handler)(void);
    /* 0x30 */ unsigned char pad_30[0x4];
    /* 0x34 */ unsigned int flags;
    /* 0x38 */ char *string;
    /* 0x3c */ unsigned int string_id;
};

struct InfoObjData {
    /* 0x00 */ unsigned char pad_0[0x4];
    /* 0x04 */ unsigned int field_4;
    /* 0x08 */ unsigned int field_8;
    /* 0x0c */ unsigned int field_c;
    /* 0x10 */ unsigned char pad_10[0x18 - 0x10];
    /* 0x18 */ int field_18;
    /* 0x1c */ struct InfoObjInner *field_1c;
};

struct InfoObjInner {
    /* 0x00 */ unsigned char pad_0[0x60];
    /* 0x60 */ unsigned char field_60;
};


#include "image_sprite.h"
#include "stream.h"
#include "worker.h"
#include "timer.h"
#include "help.h"
#include "print_sprite.h"
#include "debug_alloc.h"
#include "llidb.h"
#include "string.h"
#include "gamemap.h"
#include "map_object.h"
#include "controller.h"
#include "draw.h"
#include "sound_music.h"
#include "tilemap.h"

struct NewObjInfo {
    /* 0x00 */ unsigned char pad_0[0x26];
    /* 0x26 */ short field_26;
    /* 0x28 */ unsigned char pad_28[0x78 - 0x28];
    /* 0x78 */ char *field_78;
    /* 0x7c */ unsigned char pad_7c[0x80 - 0x7c];
    /* 0x80 */ char *field_80;
    /* 0x84 */ unsigned char pad_84[0xc4 - 0x84];
    /* 0xc4 */ char **name;
};


// FUNCTION: LEGOLAND 0x00470bb0
LEGO_EXPORT void InitPopUpInfo(void) {
    unsigned int *puVar3;
    int iVar2;

    puVar3 = &DAT_007fdec0;
    for (iVar2 = 0x40; iVar2 != 0; iVar2 = iVar2 + -1) {
        *puVar3 = 0;
        puVar3 = puVar3 + 1;
    }
    // STRING: LEGOLAND 0x004b89ac
    if (LLIDB_FindElement("POTTING SHED", &DAT_007fdfb0, 0) != 0) {
        _exit(1);
    }
    // STRING: LEGOLAND 0x004b899c
    if (LLIDB_FindElement("MECHANICS HUT", &DAT_007fdfb4, 0) != 0) {
        _exit(1);
    }
    // STRING: LEGOLAND 0x004b8a70
    if (LLIDB_FindElement("PATH CONTROL", &DAT_007fdfb8, 0) != 0) {
        _exit(1);
    }
    // STRING: LEGOLAND 0x004b83d0
    if (LLIDB_FindElement("ENTRANCE 1", &DAT_007fdfbc, 0) != 0) {
        _exit(1);
    }
    if (DAT_00668958 == NULL) {
        DAT_00668958 = (struct Sprite *)1;
        // STRING: LEGOLAND 0x004baca4
        DAT_006688e0 = LoadSprite("PU_BGMain.lls", 4);
