#pragma once

#include "legoland.h"

typedef void (*RideCallback)();

struct CallbackTable {
    /* 0x00 */ unsigned char pad_0[0x8c];
    /* 0x8c */ RideCallback cb_8c;
    /* 0x90 */ RideCallback cb_90;
    /* 0x94 */ RideCallback cb_94;
    /* 0x98 */ RideCallback cb_98;
    /* 0x9c */ RideCallback cb_9c;
    /* 0xa0 */ RideCallback cb_a0;
    /* 0xa4 */ RideCallback cb_a4;
    /* 0xa8 */ RideCallback cb_a8;
    /* 0xac */ RideCallback cb_ac;
    /* 0xb0 */ RideCallback cb_b0;
    /* 0xb4 */ unsigned char pad_b4[4];
    /* 0xb8 */ RideCallback cb_b8;
    /* 0xbc */ RideCallback cb_bc;
    /* 0xc0 */ RideCallback cb_c0;
};

struct ClassNode {
    /* 0x00 */ char *name;
    /* 0x04 */ unsigned char pad_4[8];
    /* 0x0c */ struct CallbackTable *iface;
};

void AddBasicPath();
void DrawBasicPath();
void FUN_00452990();
void FUN_004529c0();
void FUN_004529e0();
void FUN_00452a80();
void FUN_00452b70();
void FUN_00403080();
void FUN_00403bb0();
void FUN_00405110();
void FUN_00405370();
void FUN_00405460();
void FUN_00405570();
void FUN_00405630();
void FUN_00405740();
void FUN_004058a0();
void FUN_00405940();
void FUN_00405ad0();
void FUN_00405b10();
void FUN_00405bd0();
void FUN_00405e70();
void FUN_00406050();
void FUN_00406070();
void FUN_004068b0();
void FUN_004078f0();
void FUN_00410d60();
void FUN_00411a10();
void FUN_00411a20();
void FUN_00411bf0();
void FUN_00411c70();
void FUN_00411cd0();
void FUN_00413a10();
void FUN_00413a80();
void FUN_00413ad0();
void FUN_00413b50();
void FUN_00413fa0();
void FUN_00414020();
void FUN_00414220();
void FUN_00414830();
void FUN_00414880();
void FUN_00414940();
void FUN_00414950();
void FUN_00415030();
void FUN_00416e50();
void FUN_00418c80();
void FUN_00419d10();
void FUN_00419ef0();
void FUN_0041a000();
void FUN_0041a040();
void FUN_0041a2f0();
void FUN_0041a3d0();
void FUN_0041a530();
void FUN_0041a720();
void FUN_0041abd0();
void FUN_0041acf0();
void FUN_0041aee0();
void FUN_0041b100();
void FUN_0041b250();
void FUN_0041b260();
void FUN_0041b2a0();
void FUN_0041b4c0();
void FUN_0041b6d0();
void FUN_0041b6f0();
void FUN_0041b830();
void FUN_0041b880();
void FUN_0041b8e0();
void FUN_0041bd40();
void FUN_0041bfb0();
void FUN_0041c130();
void FUN_004254d0();
void FUN_0042a7b0();
void FUN_0042a950();
void FUN_0042aa10();
void FUN_0042aa90();
void FUN_0042b2a0();
void FUN_0042b2e0();
void FUN_0042b9d0();
void FUN_0042ba40();
void FUN_0042ba80();
void FUN_0042baf0();
void FUN_0042bcf0();
void FUN_0042c280();
void FUN_0042c3f0();
void FUN_0042c460();
void FUN_0042c4a0();
void FUN_0042c520();
void FUN_0042c550();
void FUN_0042c590();
void FUN_0042c600();
void FUN_0042c820();
void FUN_0042d070();
void FUN_0042d100();
void FUN_0042d1f0();
void FUN_0042d230();
void FUN_0042d270();
void FUN_0042d2c0();
void FUN_0042d2f0();
void FUN_0042d400();
void FUN_0042d610();
void FUN_0042d9c0();
void FUN_0042de50();
void FUN_0042def0();
void FUN_0042df70();
void FUN_0042dfa0();
void FUN_0042e220();
void FUN_0042e250();
void FUN_0042e260();
void FUN_0042e2a0();
void FUN_0042e460();
void FUN_0042e4b0();
void FUN_0042e4c0();
void FUN_0042e500();
void FUN_0042e560();
void FUN_0042e5d0();
void FUN_0042e600();
void FUN_0042e610();
void FUN_0042e770();
void FUN_0042e7a0();
void FUN_0042e7b0();
void FUN_0042e7e0();
void FUN_0042e7f0();
void FUN_0042e820();
void FUN_0042e830();
void FUN_0042e870();
void FUN_0042e8b0();
void FUN_0042e8d0();
void FUN_0042e910();
void FUN_0042e9c0();
void FUN_0042ea10();
void FUN_0042ea60();
void FUN_0042ec10();
void FUN_0042ed70();
void FUN_0042ef10();
void FUN_0042efb0();
void FUN_0042f030();
void FUN_0042f1a0();
void FUN_0042f4c0();
void FUN_0042f720();
void FUN_0042f770();
void FUN_0042f9a0();
void FUN_0042fa40();
void FUN_0042fbb0();
void FUN_004304a0();
void FUN_00430b10();
void FUN_00431120();
void FUN_00431170();
void FUN_004312c0();
void FUN_00431300();
void FUN_004314f0();
void FUN_00431520();
void FUN_004316f0();
void FUN_00431d00();
void FUN_004322a0();
void FUN_00432310();
void FUN_00432390();
void FUN_00432400();
void FUN_004329c0();
void FUN_00433ca0();
void FUN_00433cd0();
void FUN_00433ce0();
void FUN_00433d20();
void FUN_00433d90();
void FUN_00433fa0();
void FUN_00433fc0();
void FUN_00434040();
void FUN_00434080();
void FUN_004340b0();
void FUN_004340c0();
void FUN_00434100();
void FUN_00434330();
void FUN_00434650();
void FUN_00434670();
void FUN_00434740();
void FUN_00434cb0();
void FUN_00434e50();
void FUN_00434f50();
void FUN_00434f90();
void FUN_00435150();
void FUN_00435230();
void FUN_00435470();
void FUN_00435750();
void FUN_00435bd0();
void FUN_00435c70();
void FUN_00435ec0();
void FUN_00436160();
void FUN_00436190();
void FUN_004361a0();
void FUN_00436200();
void FUN_00436470();
void FUN_004365f0();
void FUN_00436a40();
void FUN_0043a400();
void FUN_0043c760();
void FUN_0043ce60();
void FUN_0043ceb0();
void FUN_0043ced0();
void FUN_0043cf00();
void FUN_0043d0b0();
void FUN_0043d1c0();
void FUN_0043d1d0();
void FUN_0043d210();
void FUN_0043d250();
void FUN_0043d2a0();
void FUN_0043d2c0();
void FUN_0043d2f0();
void FUN_0043d580();
void FUN_0043d730();
void FUN_0043d740();
void FUN_0043d780();
void FUN_0043e220();
void FUN_00452ab0();
void FUN_00452ad0();
void FUN_00452b20();
void FUN_00452ba0();
void FUN_00452bc0();
void Joust_GetInterfaces();
void RemoveBasicPath();
void RemoveSoundObject();
void SpaceTowerRide();
void SpiderRide();
void TempleSlide_GetInterfaces();
