#include <windows.h>
#include <dsound.h>
#include "legoland.h"
#include <stdio.h>
#include <string.h>

#include "sound_sfx.h"
#include "sound_music.h"
#include "timer.h"
#include "globals.h"
#include "math.h"
#include "debug_alloc.h"
#include "stream.h"
#include "wndenv.h"
#include "profile_io.h"
#include "tilemap.h"

struct AVISoundBuffer;
struct AVISoundBufferVtbl;
struct MusicPerformance;
struct MusicPerformanceVtbl;
struct BandObj;
struct BandVtbl;
struct CallbackEntry;
struct SampleDef;
struct FXItem;
struct FXList;
struct SampleConfig;
struct MusicLoader;
struct MusicLoaderVtbl;
struct ObjectDesc;

struct MusicLoaderVtbl {
    unsigned char pad_0[0xc];
    int(__stdcall *GetObject)(struct MusicLoader *self, struct ObjectDesc *desc, const GUID *iid, void **out);
};

struct MusicLoader {
    struct MusicLoaderVtbl *vtable;
};

struct MusicContainer;
struct MusicContainerVtbl {
    unsigned char pad_0[0xc];
    int(__stdcall *GetObject)(struct MusicContainer *self, const unsigned short *name, void **out);
    unsigned char pad_10[0x28 - 0x10];
    int(__stdcall *EnumObject)(struct MusicContainer *self, const unsigned short *name, void **out);
};

struct MusicContainer {
    struct MusicContainerVtbl *vtable;
};

struct MusicSegment;
struct MusicSegmentVtbl {
    unsigned char pad_0[8];
    int(__stdcall *Release)(struct MusicSegment *self);
    unsigned char pad_c[0x18 - 0xc];
    int(__stdcall *SetRepeats)(struct MusicSegment *self, unsigned int repeats);
};

struct MusicSegment {
    struct MusicSegmentVtbl *vtable;
};

struct MusicComposer;
struct MusicComposerVtbl {
    unsigned char pad_0[0xc];
    int(__stdcall *ComposeSegmentFromTemplate)(struct MusicComposer *self, void *style, unsigned int templateMode, unsigned int activity, void *chordMap, struct MusicSegment **out);
    int(__stdcall *ComposeSegmentFromShape)(struct MusicComposer *self, unsigned int numMeasures, unsigned int shape, unsigned int activity, int intro, int end, void *style, void *chordMap, struct MusicSegment **out);
    unsigned char pad_14[0x18 - 0x14];
    int(__stdcall *ComposeTransition)(struct MusicComposer *self, struct MusicPerformance *perf, unsigned int numMeasures, unsigned int activity, unsigned int command, void *chordMap, struct MusicSegment **out, int param8, int param9);
};

struct MusicComposer {
    struct MusicComposerVtbl *vtable;
};

struct AVIBufferDesc {
    /* 0x00 */ unsigned int dwSize;
    /* 0x04 */ unsigned int dwFlags;
    /* 0x08 */ unsigned int dwBufferBytes;
    /* 0x0c */ unsigned int dwReserved;
    /* 0x10 */ LPWAVEFORMATEX lpwfxFormat;
    /* 0x14 */ GUID guid3DAlgorithm;
};

struct SampleSource {
    /* 0x00 */ unsigned int type;
    /* 0x04 */ unsigned int field_4;
    /* 0x08 */ unsigned int field_8;
    /* 0x0c */ unsigned int field_c;
};

struct ObjectDesc {
    /* 0x000 */ unsigned int dwSize;
    /* 0x004 */ unsigned int dwValidData;
    /* 0x008 */ GUID guidObject;
    /* 0x018 */ GUID guidClass;
    /* 0x028 */ unsigned char pad_28[0x38 - 0x28];
    /* 0x038 */ unsigned short wszName[0x40];
    /* 0x0b8 */ unsigned char pad_b8[0x138 - 0xb8];
    /* 0x138 */ unsigned short wszFileName[0x10c];
};

struct MusicPerformanceVtbl {
    unsigned char pad_0[8];
    int(__stdcall *Release)(struct MusicPerformance *self);
    unsigned char pad_c[0x10 - 0xc];
    void(__stdcall *PlayMotif)(struct MusicPerformance *self, unsigned int motif, unsigned int flags, int a3, int a4, int a5);
    unsigned char pad_14[0x88 - 0x14];
    void(__stdcall *SetGlobalParam)(struct MusicPerformance *self, const GUID *type, void *data, unsigned int size);
};

struct MusicPerformance {
    struct MusicPerformanceVtbl *vtable;
};

struct AVISoundBufferVtbl {
    unsigned char pad_0[8];
    int(__stdcall *Destroy)(struct AVISoundBuffer *self);
    unsigned char pad_c[0x3c - 0xc];
    int(__stdcall *SetVolume)(struct AVISoundBuffer *self, int volume);
    unsigned char pad_40[0x48 - 0x40];
    void(__stdcall *Stop)(struct AVISoundBuffer *self);
};

struct AVISoundBuffer {
    struct AVISoundBufferVtbl *vtable;
};

struct BandVtbl {
    unsigned char pad_0[0xc];
    int(__stdcall *Create)(struct BandObj *self, void *arg);
};

struct BandObj {
    struct BandVtbl *vtable;
};

struct CallbackEntry {
    struct CallbackEntry *next;
    unsigned char pad_4[0x1c - 0x4];
    unsigned short flags;
    unsigned char pad_1e[0x20 - 0x1e];
    unsigned int timeout;
    unsigned int (*callback)(struct CallbackEntry *self);
    unsigned int active;
};

struct SampleConfig {
    unsigned int field_0;
    unsigned int field_4;
    unsigned int field_8;
    unsigned int field_c;
};

struct FXItem {
    /* 0x00 */ char *name;
    /* 0x04 */ unsigned char pad_4[0x8 - 0x4];
    /* 0x08 */ struct SampleDef *sample;
};

// FUNCTION: LEGOLAND 0x00495b90
LEGO_EXPORT void SetMusicGrooveLevel(unsigned int level) {
    if (DAT_004bf774 != 0 && DMusicInitialised != 0) {
        ((struct MusicPerformance *)DAT_007cacdc)->vtable->SetGlobalParam((struct MusicPerformance *)DAT_007cacdc, &GUID_PerfMasterGrooveLevel, &level, 1);
    }
}

// FUNCTION: LEGOLAND 0x00495bc0
LEGO_EXPORT int LoadMusicStyle(const char *filename, void **out) {
    struct ObjectDesc desc;
    unsigned short wide[512];
    int result;

    if (DAT_004bf774 == 0) {
        return 0;
    }
    if (DMusicInitialised == 0) {
        return 0;
    }
    *out = 0;
    MultiByteToWideChar(0, 0, filename, -1, wide, 0x200);
    desc.guidClass = DAT_004ab980;
    desc.dwSize = 0x350;
    wcscpy(desc.wszFileName, wide);
    desc.dwValidData = 0x12;
    result = ((struct MusicLoader *)DAT_007cacd8)->vtable->GetObject((struct MusicLoader *)DAT_007cacd8, &desc, &DAT_004ab610, out);
    return 0 <= result;
}

